"""Списки, тип данных list"""

# m =[]
# print(type(m))          # <class 'list'>

# m = [1, 2, 1, 3, 5]
# print(m[0])             # 1
# print(len(m))           # 5
# print(m[-1])            # 5

# m = [1, 2, 1, 3, 5, 'a', [1,2], ['s', 'f']] 
# print(m[-1])            # ['s', 'f']
# print(m[-1][0])            # s

# m = [[5, 6], [1, 2], ['s', 'f']]
# m[0] = 9
# print(m)                        # [9, [1, 2], ['s', 'f']]
# #print(len(m[0]))               # 3  # 2

# m[0] = m[0] + 2
# print(m)                        # [11, [1, 2], ['s', 'f']]

# m = [[5, 6], [1, 2], ['s', 'f']]
# m[1], m[2] = m[2], m[1]
# print(m)                        # [[5, 6], ['s', 'f'], [1, 2]]
# m = m + [7]
# print(m)                        # [[5, 6], ['s', 'f'], [1, 2], 7]
# m = m*2
# print(m)                        # [[5, 6], ['s', 'f'], [1, 2], 7, [5, 6], ['s', 'f'], [1, 2], 7]

# m = [[5, 6], [1, 2], ['s', 'f']]
# n = list('stroka')
# print(n)                            # ['s', 't', 'r', 'o', 'k', 'a']
# n = list(range(10))
# print(n)                            # [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

# n = list(range(10))
# # for i in n:
# #     print(i)                        # 0 1 2 3 4 5 6 7 8 9
# m = []
# for i in n:
#     if i == 8:
#         continue
#     m += [i]
# else:
#     print(m)                           # [0, 1, 2, 3, 4, 5, 6, 7, 9]

"""методы списков и срезы"""












