"""Списки, тип данных list"""

# m =[]
# print(type(m))          # <class 'list'>

# m = [1, 2, 1, 3, 5]
# print(m[0])             # 1
# print(len(m))           # 5
# print(m[-1])            # 5

# m = [1, 2, 1, 3, 5, 'a', [1,2], ['s', 'f']] 
# print(m[-1])            # ['s', 'f']
# print(m[-1][0])            # s

# m = [[5, 6], [1, 2], ['s', 'f']]
# m[0] = 9
# print(m)                        # [9, [1, 2], ['s', 'f']]
# #print(len(m[0]))               # 3  # 2

# m[0] = m[0] + 2
# print(m)                        # [11, [1, 2], ['s', 'f']]

# m = [[5, 6], [1, 2], ['s', 'f']]
# m[1], m[2] = m[2], m[1]
# print(m)                        # [[5, 6], ['s', 'f'], [1, 2]]
# m = m + [7]
# print(m)                        # [[5, 6], ['s', 'f'], [1, 2], 7]
# m = m*2
# print(m)                        # [[5, 6], ['s', 'f'], [1, 2], 7, [5, 6], ['s', 'f'], [1, 2], 7]

# m = [[5, 6], [1, 2], ['s', 'f']]
# n = list('stroka')
# print(n)                            # ['s', 't', 'r', 'o', 'k', 'a']
# n = list(range(10))
# print(n)                            # [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

# n = list(range(10))
# # for i in n:
# #     print(i)                        # 0 1 2 3 4 5 6 7 8 9
# m = []
# for i in n:
#     if i == 8:
#         continue
#     m += [i]
# else:
#     print(m)                           # [0, 1, 2, 3, 4, 5, 6, 7, 9]

"""методы списков и срезы"""

# x = [9, 8, 7, 6, 5]
# x.append(4)                 # [9, 8, 7, 6, 5, 4] добавляет эл. в конец списка
# x.insert(1, 7)                # [9, 7, 8, 7, 6, 5] добавляет эл. по выбранному индексу
# print(x.count(7))               # 1 показывает сколько выбранных эл. в списке
# x.sort()                        # сортирует список по возрастанию
# x.reverse()                     # переворачивает список [5, 6, 7, 8, 9]
# x.pop(0)                        # удаляет выбранный индекс [8, 7, 6, 5]
# y = x.pop(0)                      # удаляет выбранный индекс [8, 7, 6, 5] и сохраняет его в переменую 9
# print(y)
# x.remove(7)                      # удаляет число из списка и только первое из заданного [9, 8, 6, 5]
# x.clear()                        # полностью очищает список []
# x.extend(['a', 's'])            # добавляет в список значение из другого списка ['a', 's'] или [9, 8, 7, 6, 5, 'a', 's']
# h = x.copy()                     # копирует список в новую переменную [9, 8, 7, 6, 5]
# print(h)
# print(x)

# n = list(range(10))
# for i in n:
#     print(i)
# m = []
# for i in n:
#     if i == 8:
#         continue
#     m.append(i)                     # [0, 1, 2, 3, 4, 5, 6, 7, 9]
# else:
#     print(m)    

# n = list(range(1, 21))
# # b = n.copy()            # [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]
# # b = n[::]                # n[start: stop: step] тоже самое весь список
# # b = n[0::2]             # [1, 3, 5, 7, 9, 11, 13, 15, 17, 19] все нечетные
# # b = n[:5]               # [1, 2, 3, 4, 5]
# b = n[5:15]                 # [6, 7, 8, 9, 10, 11, 12, 13, 14, 15]
# m = []
# for i in n:
#     if i % 2 == 0:
#         m.append(i)
#         n.remove(i)
# else:
#     print(m)    # [2, 4, 6, 8, 10, 12, 14, 16, 18, 20]
#     print(n)    # [1, 3, 5, 7, 9, 11, 13, 15, 17, 19]
# print(b)

"""Кортежи, тип данных tuple"""

# x = tuple('stroka')     # x = (9, 8, 7, 6)
# print(type(x))          # <class 'tuple'> - кортеж(неизменяемый тип данных), можно писать без скобок, но обязательно ,
# print(x)                # ('s', 't', 'r', 'o', 'k', 'a')

# x = (9, 8, 7, 6, 5, 4, 3)
# # print(x[0] + 5)             # 9 + 5 = 14
# # x[0] = 10       # TypeError: 'tuple' не изменяемый тип данных
# # z, c, b, e, w, q, p = x         # количество переменных и эл. в кортеже должно быть одинаковым
# r = 5
# u = 7
# r, u = (u, r)
# # print(z, c, b)      # 9 8 7
# print(x[1:5])           #  (8, 7, 6, 5)

# x = [9, 8, 7, 6, 5, 4, 3]
# for i in range(len(x)):
#     x[i] += 3
# print(x)        # [12, 11, 10, 9, 8, 7, 6] изменить список можно

# x = (9, 8, 7, 6, 5, 4, 3)
# for i in range(len(x)):
#     x[i] += 3
# print(x)        # TypeError: 'tuple' изменить кортеж нельзя

# x = (9, 8, 7, 6, 5, 4, 3)
# y = []
# for i in range(len(x)):
#     y.append(x[i] + 3)  # создаем список из кортежа который можно изменять
# print(y)        # [12, 11, 10, 9, 8, 7, 6] создался измененный список из кортежа
# print(x)        # (9, 8, 7, 6, 5, 4, 3) кортеж не меняется

"""но все таки кортеж можно изменить"""

# x = (9, 8, 7, 6, 5, 4, 3)
# t = list(x)     # конвертируем кортеж в список
# t[0] = 10       # вносим изменения
# x = tuple(t)    # возвращаем список в кортеж
# print(x)        # (10, 8, 7, 6, 5, 4, 3)

"""методы кортежа"""

# x = (9, 8, 7, 6, 5, 9, 4, 3)
# print(x.count(9))   # сколько одинаковых эл. в кортеже 2
# print(x.index(9))   # выводит индекс только первого эл. в кортеже, похожий далее не выводится 0

"""кортежи можно складывать между собой"""
# h = (1, 2, 3)
# h += (4, 5)         # (1, 2, 3, 4, 5)
# print(h)

h = (1, 2, 3)
g = h               # такое не катит
h += (4, 5)         # (1, 2, 3, 4, 5)
print(h)            # (1, 2, 3, 4, 5)
print(g)            # (1, 2, 3)
